RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_i2c.c
/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 *******************************************************************************
 ** \brief Try to wait a status of specified flags
 ** \param [in] pstcI2Cx           Pointer to the I2C peripheral register, can
 **                                be M4_I2C1,M4_I2C2 or M4_I2C3.
 ** \param [in] u32Flag            specifies the flag to check,
 **                                This parameter can be one of the following values:
 **                                I2C_SR_STARTF
 **                                I2C_SR_SLADDR0F
 **                                I2C_SR_SLADDR1F
 **                                I2C_SR_TENDF
 **                                I2C_SR_STOPF
 **                                I2C_SR_RFULLF
 **                                I2C_SR_TEMPTYF
 **                                I2C_SR_ARLOF
 **                                I2C_SR_ACKRF: ACK status
 **                                I2C_SR_NACKF: NACK Flag
 **                                I2C_SR_TMOUTF
 **                                I2C_SR_MSL
 **                                I2C_SR_BUSY
 **                                I2C_SR_TRA
 **                                I2C_SR_GENCALLF
 **                                I2C_SR_SMBDEFAULTF
 **                                I2C_SR_SMBHOSTF
 **                                I2C_SR_SMBALRTF
 ** \param [in] enStatus           Expected status, This parameter can be one of
 **                                the following values:
 **              Set
 **              Reset
 ** \param [in] u32Timeout         Maximum count of trying to get a status of a
 **                                flag in status register
 ** \retval Ok                     Successfully gotten the expected status of the specified flags
 ** \retval ErrorTimeout           Failed to get expected status of specified flags.
 ******************************************************************************/
en_result_t I2C_WaitStatus(const M4_I2C_TypeDef *pstcI2Cx, uint32_t u32Flag, en_flag_status_t enStatus, uint32_t u32Timeout)
{
    en_result_t enRet = ErrorTimeout;
    uint32_t u32RegStatusBit;

    for(;;)
    {
        u32RegStatusBit = (pstcI2Cx->SR & u32Flag);
        if(((enStatus == Set) && (u32Flag == u32RegStatusBit))
           || ((enStatus == Reset) && (0UL == u32RegStatusBit)))
        {
            enRet = Ok;
        }

        if((Ok == enRet) || (0UL == u32Timeout))
        {
            break;
        }
        else
        {
            u32Timeout--;
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief I2C generate start condition
 ** \param [in] pstcI2Cx            Pointer to the I2C peripheral register, can
 **                                 be M4_I2C1,M4_I2C2 or M4_I2C3.
 ** \param [in] enNewState          new state of the I2Cx function, can be
 **                                 Disable or Enable the function
 ** \retval None
 ******************************************************************************/
void I2C_GenerateStart(M4_I2C_TypeDef* pstcI2Cx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_UNIT(pstcI2Cx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    pstcI2Cx->CR1_f.START = enNewState;
}

/**
 *******************************************************************************
 ** \brief I2C generate restart condition
 ** \param [in] pstcI2Cx            Pointer to the I2C peripheral register, can
 **                                 be M4_I2C1,M4_I2C2 or M4_I2C3.
 ** \param [in] enNewState          New state of the I2Cx function, can be
 **                                 Disable or Enable the function
 ** \retval None
 ******************************************************************************/
void I2C_GenerateReStart(M4_I2C_TypeDef* pstcI2Cx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_UNIT(pstcI2Cx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    pstcI2Cx->CR1_f.RESTART = enNewState;

}

/**
 *******************************************************************************
 ** \brief I2C generate stop condition
 ** \param [in] pstcI2Cx            Pointer to the I2C peripheral register, can
 **                                 be M4_I2C1,M4_I2C2 or M4_I2C3.
 ** \param [in] enNewState          New state of the I2Cx function, can be
 **                                 Disable or Enable the function
 ** \retval None
 ******************************************************************************/
void I2C_GenerateStop(M4_I2C_TypeDef* pstcI2Cx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_UNIT(pstcI2Cx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    pstcI2Cx->CR1_f.STOP = enNewState;
}

/**
 *******************************************************************************
 ** \brief Set the baudrate for I2C peripheral.
 ** \param [in] pstcI2Cx           Pointer to the I2C peripheral register, can
 **                                be M4_I2C1,M4_I2C2 or M4_I2C3.
 ** \param [in] pstcI2cInit        Pointer to I2C config structure  @ref stc_i2c_init_t
 **           1. pstcI2cInit->u32ClockDiv: Division of i2c source clock, reference as:
 **              step1: calculate div = (I2cSrcClk/Baudrate/(68+2*dnfsum+SclTime)
 **                     I2cSrcClk -- I2c source clock
 **                     Baudrate -- baudrate of i2c
 **                     SclTime  -- =(SCL rising time + SCL falling time)/period of i2c clock
 **                                 according to i2c bus hardware parameter.
 **                     dnfsum   -- 0 if digital filter off;
 **                                 Filter capacity if digital filter on(1 ~ 4)
 **              step2: chose a division item which is similar and bigger than div
 **                     from @ref I2C_Clock_Division.
 **           2. pstcI2cInit->u32Baudrate : Baudrate configuration
 **           3. pstcI2cInit->u32SclTime : Indicate SCL pin rising and falling
 **              time, should be number of T(i2c clock period time)
 ** @param  [out] pf32Error          Baudrate error
 ** @retval en_result_t              Enumeration value:
 **         @arg Ok:                 Configurate success
 **         @arg ErrorInvalidParameter:  Invalid parameter
 ******************************************************************************/
en_result_t I2C_BaudrateConfig(M4_I2C_TypeDef* pstcI2Cx, const stc_i2c_init_t* pstcI2cInit, float32_t *pf32Error)
{
    en_result_t enRet = Ok;
    uint32_t I2cSrcClk;
    uint32_t I2cDivClk;
    uint32_t SclCnt;
    uint32_t Baudrate;
    uint32_t dnfsum = 0UL;
    uint32_t divsum = 2UL;
    uint32_t TheoryBaudrate;
    float32_t WidthTotal;
    float32_t SumTotal;
    float32_t WidthHL;
    float32_t fErr = 0.0F;

    if ((NULL == pstcI2cInit) || (NULL == pf32Error))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_UNIT(pstcI2Cx));
        DDL_ASSERT(IS_VALID_SPEED(pstcI2cInit->u32Baudrate));
        DDL_ASSERT(IS_VALID_FDIV(pstcI2cInit->u32ClockDiv));

