RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_i2c.c
        /* Get configuration for i2c */
        I2cSrcClk = I2C_SRC_CLK;
        I2cDivClk = 1ul << pstcI2cInit->u32ClockDiv;
        SclCnt = pstcI2cInit->u32SclTime;
        Baudrate = pstcI2cInit->u32Baudrate;

        /* Judge digital filter status */
        if(1u == pstcI2Cx->FLTR_f.DNFEN)
        {
            dnfsum = pstcI2Cx->FLTR_f.DNF+1ul;
        }

        /* Judge if clock divider on*/
        if(I2C_CLK_DIV1 == pstcI2cInit->u32ClockDiv)
        {
            divsum = 3ul;
        }

        WidthTotal = (float32_t)I2cSrcClk / (float32_t)Baudrate / (float32_t)I2cDivClk;
        SumTotal = (2.0F*(float32_t)divsum) + (2.0F*(float32_t)dnfsum) + (float32_t)SclCnt;
        WidthHL = WidthTotal - SumTotal;

        /* Integer for WidthTotal, rounding off */
        if ((WidthTotal - (float32_t)((uint32_t)WidthTotal)) >= 0.5F)
        {
            WidthTotal = (float32_t)((uint32_t)WidthTotal) + 1.0F;
        }
        else
        {
            WidthTotal = (float32_t)((uint32_t)WidthTotal);
        }

        if(WidthTotal <= SumTotal)
        {
            /* Err, Should set a smaller division value for pstcI2cInit->u32ClockDiv */
            enRet = ErrorInvalidParameter;
        }
        else
        {
            if(WidthHL > I2C_SCL_HIGHT_LOW_LVL_SUM_MAX)
            {
                /* Err, Should set a bigger division value for pstcI2cInit->u32ClockDiv */
                enRet = ErrorInvalidParameter;
            }
            else
            {
                TheoryBaudrate = I2cSrcClk / (uint32_t)WidthTotal / I2cDivClk;
                fErr = ((float32_t)Baudrate - (float32_t)TheoryBaudrate) / (float32_t)TheoryBaudrate;

                /* Write register */
                pstcI2Cx->CCR_f.FREQ = pstcI2cInit->u32ClockDiv;
                pstcI2Cx->CCR_f.SLOWW = (uint32_t)WidthHL/2u;
                pstcI2Cx->CCR_f.SHIGHW = (uint32_t)WidthHL - ((uint32_t)WidthHL)/2u;
            }
        }
    }

    if((NULL != pf32Error) && (Ok == enRet))
    {
        *pf32Error = fErr;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief De-initialize I2C unit
 ** \param [in] pstcI2Cx            Pointer to the I2C peripheral register, can
 **                                 be M4_I2C1,M4_I2C2 or M4_I2C3.
 ** \retval Ok                      Process finished.
 ******************************************************************************/
en_result_t I2C_DeInit(M4_I2C_TypeDef* pstcI2Cx)
{
    DDL_ASSERT(IS_VALID_UNIT(pstcI2Cx));

    /* Reset peripheral register and internal status*/
    pstcI2Cx->CR1_f.PE = 0u;
    pstcI2Cx->CR1_f.SWRST = 1u;
    return Ok;
}

/**
 *******************************************************************************
 ** \brief Initialize I2C peripheral according to the structure
 ** \param [in] pstcI2Cx            Pointer to the I2C peripheral register, can
 **                                 be M4_I2C1,M4_I2C2 or M4_I2C3.
 ** \param [in] pstcI2cInit        Pointer to I2C config structure  @ref stc_i2c_init_t
 **           1. pstcI2cInit->u32ClockDiv: Division of i2c source clock, reference as:
 **              step1: calculate div = (I2cSrcClk/Baudrate/(68+2*dnfsum+SclTime)
 **                     I2cSrcClk -- I2c source clock
 **                     Baudrate -- baudrate of i2c
 **                     SclTime  -- =(SCL rising time + SCL falling time)/period of i2c clock
 **                                 according to i2c bus hardware parameter.
 **                     dnfsum   -- 0 if digital filter off;
 **                                 Filter capacity if digital filter on(1 ~ 4)
 **              step2: chose a division item which is similar and bigger than div
 **                     from @ref I2C_Clock_Division.
 **           2. pstcI2cInit->u32Baudrate : Baudrate configuration
 **           3. pstcI2cInit->u32SclTime : Indicate SCL pin rising and falling
 **              time, should be number of T(i2c clock period time)
 ** @param  [out] pf32Error          Baudrate error
 ** @retval en_result_t              Enumeration value:
 **         @arg Ok:                 Configurate success
 **         @arg ErrorInvalidParameter:  Invalid parameter
 ******************************************************************************/
en_result_t I2C_Init(M4_I2C_TypeDef* pstcI2Cx, const stc_i2c_init_t* pstcI2cInit, float32_t *pf32Error)
{
    en_result_t enRes = Ok;
    if((NULL == pstcI2cInit) || (NULL == pstcI2Cx))
    {
        enRes = ErrorInvalidParameter;
    }
    else
    {
        DDL_ASSERT(IS_VALID_UNIT(pstcI2Cx));
        DDL_ASSERT(IS_VALID_SPEED(pstcI2cInit->u32Baudrate));
        DDL_ASSERT(IS_VALID_FDIV(pstcI2cInit->u32ClockDiv));

        /* Register and internal status reset */
        pstcI2Cx->CR1_f.PE = 0u;
        pstcI2Cx->CR1_f.SWRST = 1u;

        pstcI2Cx->CR1_f.PE = 1u;

        enRes = I2C_BaudrateConfig(pstcI2Cx, pstcI2cInit, pf32Error);

        pstcI2Cx->CR1_f.ENGC = 0u;
        pstcI2Cx->CR1_f.SWRST = 0u;
        pstcI2Cx->CR1_f.PE = 0u;
    }
    return enRes;
}

/**
 *******************************************************************************
 ** \brief I2C slave address0 config
 ** \param [in] pstcI2Cx            Pointer to the I2C peripheral register, can
 **                                 be M4_I2C1,M4_I2C2 or M4_I2C3.
 ** \param [in] enNewState          New state of the I2Cx function, can be
 **                                 Disable or Enable the function
 ** \param [in] enAdrMode           Address mode,can be Adr7bit or Adr10bit
 ** \param [in] u32Adr              The slave address
 ** \retval None
 ******************************************************************************/
void I2C_SlaveAdr0Config(M4_I2C_TypeDef* pstcI2Cx, en_functional_state_t enNewState, en_address_bit_t enAdrMode, uint32_t u32Adr)
{
    DDL_ASSERT(IS_VALID_UNIT(pstcI2Cx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_VALID_ADRMODE(enAdrMode));

    pstcI2Cx->SLR0_f.SLADDR0EN = enNewState;
    pstcI2Cx->SLR0_f.ADDRMOD0 = enAdrMode;
    if(Adr7bit == enAdrMode)
    {
        DDL_ASSERT(IS_VALID_7BIT_ADR(u32Adr));
        pstcI2Cx->SLR0_f.SLADDR0 = u32Adr << 1ul;
    }
    else
    {
        DDL_ASSERT(IS_VALID_10BIT_ADR(u32Adr));
        pstcI2Cx->SLR0_f.SLADDR0 = u32Adr;
    }
}

/**
 *******************************************************************************
 ** \brief I2C slave address1 config
 ** \param [in] pstcI2Cx            Pointer to the I2C peripheral register, can
 **                                 be M4_I2C1,M4_I2C2 or M4_I2C3.
 ** \param [in] enNewState          New state of the I2Cx function, can be
 **                                 Disable or Enable the function
 ** \param [in] enAdrMode           Address mode,can be Adr7bit or Adr10bit
 ** \param [in] u32Adr              The slave address
 ** \retval None
 ******************************************************************************/
void I2C_SlaveAdr1Config(M4_I2C_TypeDef* pstcI2Cx, en_functional_state_t enNewState, en_address_bit_t enAdrMode, uint32_t u32Adr)
{
    DDL_ASSERT(IS_VALID_UNIT(pstcI2Cx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_VALID_ADRMODE(enAdrMode));

    pstcI2Cx->SLR1_f.SLADDR1EN = enNewState;
    pstcI2Cx->SLR1_f.ADDRMOD1 = enAdrMode;
    if(Adr7bit == enAdrMode)
    {
        DDL_ASSERT(IS_VALID_7BIT_ADR(u32Adr));
        pstcI2Cx->SLR1_f.SLADDR1 = u32Adr << 1ul;
    }
    else
    {
        DDL_ASSERT(IS_VALID_10BIT_ADR(u32Adr));
        pstcI2Cx->SLR1_f.SLADDR1 = u32Adr;
    }
}

/**
 *******************************************************************************
 ** \brief I2C function command
 ** \param [in] pstcI2Cx            Pointer to the I2C peripheral register, can
 **                                 be M4_I2C1,M4_I2C2 or M4_I2C3.
 ** \param [in] enNewState          New state of the I2Cx function, can be
 **                                 Disable or Enable the function
 ** \retval None
 ******************************************************************************/
void I2C_Cmd(M4_I2C_TypeDef* pstcI2Cx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_UNIT(pstcI2Cx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    pstcI2Cx->CR1_f.PE = enNewState;
}

/**
 *******************************************************************************
 ** \brief I2C fast ACK function command
 ** \param [in] pstcI2Cx            Pointer to the I2C peripheral register, can
 **                                 be M4_I2C1,M4_I2C2 or M4_I2C3.
 ** \param [in] enNewState          New state of the fast ACK function, can be
 **                                 Disable or Enable the function
 ** \retval None
 ******************************************************************************/
void I2C_FastAckCmd(M4_I2C_TypeDef* pstcI2Cx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_UNIT(pstcI2Cx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

