RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_i2c.c
    DDL_ASSERT(IS_VALID_UNIT(pstcI2Cx));

    if(au8RxData != NULL)
    {
        uint32_t u32FastAckDis = (pstcI2Cx->CR3_f.FACKEN);
        for(uint32_t i=0ul; i<u32Size; i++)
        {
            enRet = I2C_WaitStatus(pstcI2Cx, I2C_SR_RFULLF, Set, u32Timeout);

            if(0ul == u32FastAckDis)
            {
                if((u32Size >= 2ul) && (i == (u32Size - 2ul)))
                {
                    I2C_AckConfig(pstcI2Cx, I2c_NACK);
                }
            }
            else
            {
                if(i != (u32Size - 1ul))
                {
                    I2C_AckConfig(pstcI2Cx, I2c_ACK);
                }
                else
                {
                    I2C_AckConfig(pstcI2Cx, I2c_NACK);
                }
            }

            if(enRet == Ok)
            {
                /* Stop before read last data */
                if(i == (u32Size - 1ul))
                {
                    I2C_ClearStatus(pstcI2Cx, I2C_CLR_STOPFCLR);
                    I2C_GenerateStop(pstcI2Cx, Enable);
                }

                 /* read data from register */
                au8RxData[i] = I2C_ReadData(pstcI2Cx);

                /* Wait stop flag after DRR read */
                if(i == (u32Size - 1ul))
                {
                    enRet = I2C_WaitStatus(pstcI2Cx, I2C_SR_STOPF, Set, u32Timeout);
                }
            }
            else
            {
                break;
            }
        }
        I2C_AckConfig(pstcI2Cx, I2c_ACK);
    }
    else
    {
        enRet = ErrorInvalidParameter;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief I2Cx stop
 ** \param [in] pstcI2Cx            Pointer to the I2C peripheral register, can
 **                                 be M4_I2C1,M4_I2C2 or M4_I2C3.
 ** \param [in] u32Timeout          Maximum count of trying to get a status of a
 **                                 flag in status register
 ** \retval Ok:                     Receive successfully
 ** \retval ErrorTimeout:           Receive data time out
 ******************************************************************************/
en_result_t I2C_Stop(M4_I2C_TypeDef* pstcI2Cx, uint32_t u32Timeout)
{
    en_result_t enRet;

    DDL_ASSERT(IS_VALID_UNIT(pstcI2Cx));

    /* Clear stop flag */
    while((Set == I2C_GetStatus(pstcI2Cx, I2C_SR_STOPF)) && (u32Timeout > 0ul))
    {
        I2C_ClearStatus(pstcI2Cx, I2C_CLR_STOPFCLR);
        u32Timeout--;
    }
    I2C_GenerateStop(pstcI2Cx, Enable);
    /* Wait stop flag */
    enRet = I2C_WaitStatus(pstcI2Cx, I2C_SR_STOPF, Set, u32Timeout);

    return enRet;
}

//@} // I2cGroup

#endif /* DDL_I2C_ENABLE */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
